#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.BinhMinhIdCardAPI.cloudflare_record.bmidcard_api: Refreshing state... [id=6e9cfbacb5fa5c433735b7be41fee631]
module.TestReady.heroku_app.testready: Refreshing state... [id=testready-megatunger]
module.SolveX.cloudflare_record.sendgrid_3: Refreshing state... [id=c4b8454a9d71b68bfc6b28ceb9d754b8]
module.SolveX.cloudflare_record.www_solvex: Refreshing state... [id=02167562fc156ab2230e9e261380828a]
module.TestReady.cloudflare_record.testready: Refreshing state... [id=633b4e558148faceea66d6e1d5880876]
module.LuaLepAPI.heroku_app.lualep: Refreshing state... [id=lua-lep-api]
module.SolveX.cloudflare_record.sendgrid_2: Refreshing state... [id=a039cf16b7ac184277b1ecaab0d04609]
module.SolveX.cloudflare_record.sendgrid_1: Refreshing state... [id=b5523c95faab9fda12b0e5f442cf4090]
module.SolveX.cloudflare_record.solvex: Refreshing state... [id=ac93fa368b3a8aadef8954935207cfc8]
module.TestReady.cloudflare_record.www_testready: Refreshing state... [id=f6c9a4e7941a8e864238a3cceadd1cef]
module.SolveX.heroku_app.solvex: Refreshing state... [id=solve-x]
module.LuaLepAPI.cloudflare_record.lualep: Refreshing state... [id=d9e619af5ed3a3229b73c1179bd37a77]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_1: Refreshing state... [id=3582aff137e0b139f4a62723944643ef]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_4: Refreshing state... [id=b4f9e88334045a0e35152b58812bb713]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_3: Refreshing state... [id=c637dde6b0a6ca0b95a9290488db1e4f]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_2: Refreshing state... [id=a5375d4fa013a7250d1f22dd5cb23e47]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_5: Refreshing state... [id=b6758c86fbd62dec46e0ad573d11fbc4]
module.BinhMinhIdCardAPI.heroku_app.bmidcard_api: Refreshing state... [id=binhminh-idcard-api]
module.TestReady.heroku_domain.www_testready: Refreshing state... [id=fab695c8-ee64-4530-abef-ba4ea9141f6e]
module.TestReady.heroku_build.testready: Refreshing state... [id=7f8dabbc-8eba-4464-b65d-f31f0fa43c9c]
module.TestReady.heroku_addon.database: Refreshing state... [id=3a3dfb0f-7372-439c-9263-4906fbd57f43]
module.TestReady.heroku_domain.testready: Refreshing state... [id=4853ba53-4640-44cd-8bca-78b3e07c10e1]
module.TestReady.heroku_addon.redis: Refreshing state... [id=36d41931-c9a0-4941-89b3-2a1e085d695a]
module.LuaLepAPI.heroku_build.lualep: Refreshing state... [id=8f168cb6-c51e-4f6a-a8d0-2594681b7c16]
module.SolveX.heroku_addon.redis: Refreshing state... [id=282f8acf-e795-4162-b0d1-a1b22629221c]
module.SolveX.heroku_build.solvex: Refreshing state... [id=1f7169c6-9a10-4ac5-be19-e55ade571b8a]
module.SolveX.heroku_domain.www_solvex: Refreshing state... [id=be5e491b-f397-48f3-9700-d8f4ac09161c]
module.SolveX.heroku_domain.solvex: Refreshing state... [id=c0c01379-8113-4f2c-a6c2-a1e0d4fb7db7]
module.SolveX.heroku_addon.database: Refreshing state... [id=c41f69a1-4745-45e9-ab79-35da5d43423c]
module.BinhMinhIdCardAPI.heroku_build.bmidcard_api: Refreshing state... [id=ecb8f54e-69c9-4342-b1d8-e6c6d03f0796]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.PersonalBlog.cloudflare_record.megatunger will be created
  + resource "cloudflare_record" "megatunger" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "@"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "megatunger-blog.herokuapp.com"
      + zone_id     = "0783d89a07c4a168916840cd39a8bc00"
    }

  # module.PersonalBlog.cloudflare_record.www_megatunger will be created
  + resource "cloudflare_record" "www_megatunger" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "megatunger-blog.herokuapp.com"
      + zone_id     = "0783d89a07c4a168916840cd39a8bc00"
    }

  # module.PersonalBlog.heroku_app.megatunger_blog will be created
  + resource "heroku_app" "megatunger_blog" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "megatunger-blog"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.PersonalBlog.heroku_build.megatunger_blog will be created
  + resource "heroku_build" "megatunger_blog" {
      + app               = (known after apply)
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + source            = {
          + "url" = "https://github.com/megatunger/PersonalBlog/archive/master.tar.gz"
        }
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)
    }

  # module.PersonalBlog.heroku_domain.megatunger_blog will be created
  + resource "heroku_domain" "megatunger_blog" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "megatunger.com"
      + id       = (known after apply)
    }

  # module.PersonalBlog.heroku_domain.www_megatunger_blog will be created
  + resource "heroku_domain" "www_megatunger_blog" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "www.megatunger.com"
      + id       = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @megatunger, Action: `pull_request`*